In [76]:
import pandas as pd

# Clean Education and Earning Dataset

In [77]:
df = pd.read_csv("original databases/Education and Earnings.csv")
df.head()

,COUNTRY,Country,ISC11A,ISC11A.1,SEX,Gender,AGE,Age,EARN_CATEGORY,EARN_CATEGORY.1,...,Year,Unit Code,Unit,PowerCode Code,PowerCode,Reference Period Code,Reference Period,Value,Flag Codes,Flags
0,CZE,Czech Republic,L6,Bachelor’s or equivalent education,F,Women,Y55T64,55-64 years,PTPY_EARNERS,Part-time or part-year earners,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,NaN,m,Missing data
1,FIN,Finland,L7T8,"Master’s, Doctoral or equivalent education",M,Men,Y25T64,25-64 years,NO_EARNINGS,No earnings,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,7.504321,NaN,NaN
2,KOR,Korea,L5,Short-cycle tertiary education,M,Men,Y25T34,25-34 years,NO_EARNINGS,No earnings,...,Latest available year,PC,Percentage,0,Units,2019.0,2019.0,23.137910,NaN,NaN
3,NLD,Netherlands,L6,Bachelor’s or equivalent education,F,Women,Y25T64,25-64 years,FTFY_EARNERS,"Full-time, full-year earners",...,Latest available year,PC,Percentage,0,Units,2019.0,2019.0,NaN,m,Missing data
4,ESP,Spain,L5,Short-cycle tertiary education,M,Men,Y55T64,55-64 years,PTPY_EARNERS,Part-time or part-year earners,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,16.337100,NaN,NaN

Remove redundant columns

In [78]:
df = df.drop(["ISC11A","SEX", "AGE", "EARN_CATEGORY", "Reference Period Code"], axis=1)

Remove Unnecessary Columns

In [79]:
df = df.drop(["YEAR", "INDICATOR", "Indicator", "MEASURE", "Measure", "Unit", "Year","Unit Code", "PowerCode Code", "PowerCode", "Flag Codes", "Flags"],  axis=1)

df.head()

,COUNTRY,Country,ISC11A.1,Gender,Age,EARN_CATEGORY.1,Reference Period,Value
0,CZE,Czech Republic,Bachelor’s or equivalent education,Women,55-64 years,Part-time or part-year earners,2018.0,NaN
1,FIN,Finland,"Master’s, Doctoral or equivalent education",Men,25-64 years,No earnings,2018.0,7.504321
2,KOR,Korea,Short-cycle tertiary education,Men,25-34 years,No earnings,2019.0,23.137910
3,NLD,Netherlands,Bachelor’s or equivalent education,Women,25-64 years,"Full-time, full-year earners",2019.0,NaN
4,ESP,Spain,Short-cycle tertiary education,Men,55-64 years,Part-time or part-year earners,2018.0,16.337100

In [80]:
df = df.dropna()

In [81]:
df.head()

,COUNTRY,Country,ISC11A.1,Gender,Age,EARN_CATEGORY.1,Reference Period,Value
1,FIN,Finland,"Master’s, Doctoral or equivalent education",Men,25-64 years,No earnings,2018.0,7.504321
2,KOR,Korea,Short-cycle tertiary education,Men,25-34 years,No earnings,2019.0,23.137910
4,ESP,Spain,Short-cycle tertiary education,Men,55-64 years,Part-time or part-year earners,2018.0,16.337100
5,CAN,Canada,Short-cycle tertiary education,Total,25-34 years,"Full-time, full-year earners",2018.0,57.607890
7,NZL,New Zealand,"Master’s, Doctoral or equivalent education",Men,25-64 years,No earnings,2019.0,9.804529

In [82]:
df.to_csv("cleaned databases/edu_earnings.csv")

# Clean Enrolment by Field

In [84]:
df = pd.read_csv("original databases/Enrolment by Field.csv")
df.head()

,COUNTRY,Country,SEX,Gender,EDUCATION_FIELD,Field,MOBILITY,International mobility,EDUCATION_LEV,Education level,YEAR,Year,Value,Flag Codes,Flags
0,AUS,Australia,M,Male,F01,Education,_T,Total,ISCED11_5,Short-cycle tertiary education,2019,2019,3496.0,NaN,NaN
1,AUS,Australia,F,Female,F01,Education,MOB,Mobile including homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,4039.0,NaN,NaN
2,AUS,Australia,M,Male,F01,Education,MOB,Mobile including homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,301.0,NaN,NaN
3,AUS,Australia,F,Female,F01,Education,MOB_HOME,Homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,NaN,m,Missing value; data cannot exist
4,AUS,Australia,M,Male,F01,Education,_T,Total,ISCED11_6,Bachelor’s or equivalent level,2019,2019,19886.5,NaN,NaN

Remove columns with redundant data

In [85]:
df = df.drop(["SEX", "EDUCATION_FIELD", "YEAR"], axis=1)

Remove columns with Unnecessary data

In [86]:
df = df.drop(["MOBILITY", "EDUCATION_LEV", "Flag Codes", "Flags"], axis=1)

Remove rows with NAN values

In [87]:
df = df.dropna()

In [88]:
df

,COUNTRY,Country,Gender,Field,International mobility,Education level,Year,Value
0,AUS,Australia,Male,Education,Total,Short-cycle tertiary education,2019,3496.000
1,AUS,Australia,Female,Education,Mobile including homecoming nationals,Short-cycle tertiary education,2019,4039.000
2,AUS,Australia,Male,Education,Mobile including homecoming nationals,Short-cycle tertiary education,2019,301.000
4,AUS,Australia,Male,Education,Total,Bachelor’s or equivalent level,2019,19886.500
5,AUS,Australia,Female,Education,Mobile including homecoming nationals,Bachelor’s or equivalent level,2019,3616.138
...,...,...,...,...,...,...,...,...
9353,KOR,Korea,Female,"Natural sciences, mathematics and statistics",Mobile including homecoming nationals,Bachelor’s or equivalent level,2019,412.000
9354,NOR,Norway,Male,"Agriculture, forestry, fisheries and veterinary",Total,Master’s or equivalent level,2019,238.000
9357,LVA,Latvia,Male,Information and Communication Technologies (ICTs),Total,Doctoral or equivalent level,2019,78.000
9358,DNK,Denmark,Male,"Natural sciences, mathematics and statistics",Homecoming nationals,Doctoral or equivalent level,2019,9.000
9359,JPN,Japan,Female,Education,Mobile including homecoming nationals,Master’s or equivalent level,2019,667.000

In [89]:
df.to_csv("cleaned databases/enrol_field.csv")

# Clean Enrolment by type of Institution Dataset

In [91]:
df = pd.read_csv("original databases/Enrolment by type of Institution.csv")
df.head()

,COUNTRY,Country,SEX,Gender,REF_SECTOR,Reference sector,INTENSITY,Intensity,EDUCATION_LEV,Education level,UNIT_MEASURE,Unit,YEAR,Year,Value,Flag Codes,Flags
0,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2013,2013,166673.0,NaN,NaN
1,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2014,2014,172519.0,NaN,NaN
2,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2015,2015,401223.0,NaN,NaN
3,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2016,2016,383699.0,NaN,NaN
4,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2017,2017,296421.0,NaN,NaN

Remove columns with unnecessary data

In [92]:
df = df.drop(["SEX", "Gender","UNIT_MEASURE", "Unit", "Flag Codes", "Flags"], axis=1)

Remove columns with redundant data

In [93]:
df = df.drop(["REF_SECTOR", "INTENSITY", "EDUCATION_LEV", "YEAR"], axis=1)

Remove rows with NAN values

In [94]:
df = df.dropna()

In [95]:
df.head()

,COUNTRY,Country,Reference sector,Intensity,Education level,Year,Value
0,AUS,Australia,Public educational institutions,Full- and part-time,Short-cycle tertiary education,2013,166673.0
1,AUS,Australia,Public educational institutions,Full- and part-time,Short-cycle tertiary education,2014,172519.0
2,AUS,Australia,Public educational institutions,Full- and part-time,Short-cycle tertiary education,2015,401223.0
3,AUS,Australia,Public educational institutions,Full- and part-time,Short-cycle tertiary education,2016,383699.0
4,AUS,Australia,Public educational institutions,Full- and part-time,Short-cycle tertiary education,2017,296421.0

In [96]:
df.to_csv("cleaned databases/enroll_institution_type.csv")

# Create Dataframes to be inserted